# #Homework 6  (05.11.2022)
#
# # 1. Написати Python-скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.
#
a = []
for i in range(1, 101):
    if i % 7 == 0:
        a.append(i)
print(a)
#
# # 2. Написати Python-скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).
# # v.1
import math
n = int(input('enter number='))
print(math.factorial(n))

# v.2

n = int(input())
factorial = 1
for i in range(2, n + 1):
    factorial *= i
print(factorial)

# 3  Написати Python-скрипт, який виводить на екран таблицю множення на 5.
# Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...

#
#
for t in range(1, 11):
    print(5, 'x', t, '=', t * 5)

#######################################################################################################################
# 4 Написати Python-скрипт, який виводить на екран прямокутник із '*'.
# Висота і ширина прямокутника вводяться з клавіатури.
# Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.

# *****
# *      *
# *      *
# *****


wide, hight = int(input('wide=')), int(input('hight='))

rectangle = f"{'*' * wide}\n" + f"*{' ' * (wide - 2)}*\n" * (hight - 2) + f"{'*' * wide}\n"
print(rectangle)


# 5. Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.

s = [0, 5, 2, 4, 7, 1, 3, 19]
for l in s:
    if not l % 2 == 0:
        print(l)


# 6 Створіть список випадкових чисел (розміром 4 елементи).
# Створіть другий список у два рази більше першого, де перші 4 елементи повинні дорівнювати елементам першого списку,
# а решта елементів - подвоєним значенням початкових.

# Наприклад,
# Було → [1,4,7,2]
# Стало → [1,4,7,2,2,8,14,4]

import random


random_one = [random.randint(0, 10) for i in range(4)]
print(random_one)

random_two = random_one[:] + [j * 2 for j in random_one]
print(random_two)




# 7. Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.#



salary = [random.randint(10_000, 50_000) for i in range(12)]
print(salary)
mid_salary = sum(salary) / len(salary)
print(mid_salary)




# 8. Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9,10, 11, 12]
# [13,14, 15, 16]
# Напишіть Python-скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.

matrix = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]
e = 0
for w in matrix:
    print(w)
    print(sum(w))
    e += sum(w)
print('finish')
print('sum of all numbers in matrix = ', e)


# 9. Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].
# Список може бути довільною довжиною.
import random
new_list = [random.randint(0, 100) for k in range(7)]
print(new_list)
for l in reversed(new_list):
    print(l)


# 10  За допомогою циклів вивести на екран усі прості числа від 1 до 100.


for x in range (1, 101):
    p = 1
    for d in range (2, int(x ** 0.5) + 1):
        if x % d == 0:
            p = 0
    if p == 0:
        print(x)



# 11  Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне).
# У прикладі ширина дорівнює 5.
#  *****
#  ***
#   *
#  ***
# *****

num = int(input('num='))

space = 0
res = []
for s in range(num, 0, -2):
    res.append(f"{' ' * space}{'*' * s}"'\n')
    space += 1

res += res[-2::-1]
result = ''.join(res)
print(result)